const questions = [
  {
    text: "Яка столиця України?",
    choices: ["Київ", "Харків", "Львів", "Одеса"],
    answer: "Київ"
  },
  {
    text: "Яка найбільша річка України?",
    choices: ["Дніпро", "Дунай", "Дністер", "Прут"],
    answer: "Дніпро"
  },
  {
    text: "Як називається найвища гора Українських Карпат?",
    choices: ["Говерла", "Піп Іван Чорногірський", "Петрос", "Гимба"],
    answer: "Говерла"
  },
  {
    text: "Який кольори має прапор України?",
    choices: ["Жовтий і блакитний", "Червоний і чорний", "Зелений і синій", "Білий і червоний"],
    answer: "Жовтий і блакитний"
  },
  {
    text: "Україна розташована в:",
    choices: ["Східній Європі", "Південній Азії", "Північній Америці", "Центральній Африці"],
    answer: "Східній Європі"
  },
  {
    text: "Яка назва найбільшого озера в Україні?",
    choices: ["Світязь", "Ялпуг", "Молоде", "Синевир"],
    answer: "Світязь"
  },
  {
    text: "Ким був Тарас Шевченко?",
    choices: ["Письменником", "Художником", "Музикантом", "Політиком"],
    answer: "Письменником"
  },
  {
    text: "Хто є автором 'Кобзаря'?",
    choices: ["Тарас Шевченко", "Іван Франко", "Леся Українка", "Микола Гоголь"],
    answer: "Тарас Шевченко"
  },
  {
    text: "Яка назва найвідомішого українського фестивалю?",
    choices: ["Gogolfest", "Koktebel Jazz Festival", "Atlas Weekend", "Захід"],
    answer: "Atlas Weekend"
  },
  {
    text: "Яка назва найбільшого національного парку в Україні?",
    choices: ["Карпати", "Синевир", "Голосіївський", "Олешківські піски"],
    answer: "Олешківські піски"
  }
];

const shuffledQuestions = questions.sort(() => Math.random() - 0.5);

export default shuffledQuestions;